import 'package:flutter/material.dart';
import 'package:get/get.dart';

class BuildMainTextPartWidget extends StatelessWidget {
  const BuildMainTextPartWidget({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return SizedBox(
      width: Get.width,
      // height: Get.height * 1.5,
      child: Column(
        children: [
          _buildFirstText(),
          SizedBox(
            height: Get.height * .1,
          ),
          _buildTextItem(
            imageLeft: true,
            text: '۱) نظریه شناختیِ یادگیری\n'
                'نظریه شناختی اولین و ساده‌ترین نظریه مدرن درباره یادگیری است. نظریه‌های مدرن یادگیری بر رابطه ذهن شما و محیط‌ اطراف‌تان تاکید می‌کنند. در نظریات سنتی، ذهن یک لوح سفید بود که مانند آینه‌ای صاف، واقعیت روی آن نقش می‌بست. اما در نظریات مدرن، ذهن شما فعال‌تر از آنی است که در وهله اول به نظر می‌رسد. ذهن دائما با واقعیت در ارتباط است و این دو بر هم تاثیر می‌گذارند.\n'
                'اما نظریه شناختی که در اساس درباره فرایند شناخت و تفکر است چه بهره و نتیجه‌ای برای آموزش دارد. نظریه شناختی مدعی است انسان‌ها اگر آگاه باشند که فرایند شناخت و تفکر فرایندی فعال است، آنگاه متوجه می‌شوند که می‌توانند روی فرایند آموزش و یادگیری خودشان کنترل بیشتری داشته باشند.\n'
                'تئوری یادگیری شناختی بر دانش‌آموزان تأثیر می‌گذارد، زیرا درک آن‌ها از فرآیند فکرشان می‌تواند به یادگیری آنها کمک کند. معلمان می توانند به دانش‌آموزان فرصت دهند که بپرسند، شکست بخورند و با صدای بلند فکر کنند. این استراتژی‌ها می‌توانند به دانش‌آموزان کمک کنند تا بفهمند فرآیند فکرشان چگونه کار می‌کند و از این دانش برای ایجاد فرصت‌های یادگیری بهتر استفاده کنند.\n',
            imagePath: 'assets/image/shape8.png',
          ),
          _buildTextItem(
            imageLeft: false,
            text: '\n۲) نظریه رفتاری یادگیری'
                '\nایده این نظریه آن است که دانش‌آموزان چگونه براساس تعامل‌شان با محیط، رفتار می‌کنند. حرف اصلی این نظریه آن است که رفتار آدمیان بیشتر تحت‌تاثیر محیط خارجی است تا نیروهای ذهنی درونی آدم‌ها. ریشه‌های این نظریه در قرن نوزدهم است و پایه‌های نظریه‌های روان‌شناسی رفتاری و کمی‌گرا را تشکیل می‌دهد.'
                '\nمهم‌ترین آموزه رفتارگرایی نقش مشوق‌ها و تنبیه‌ها در یادگیری است که برای اولین‌بار در آزمایش‌های دانشمندی به اسم پاولوف اثبات شد.'
                '\nبرحسب این نظریه، معلمان می‌توانند از تشویق (تقویت مثبت) برای بهبود یادگیری استفاده کنند. دانش‌آموزانی تشویق می‌شوند احتمالاً یادگیری بهتری خواهند داشت.,',
            imagePath: 'assets/image/shape9.png',
          ),
          _buildTextItem(
            imageLeft: true,
            text: '\n۳) نظریه برساخت‌گرایی یادگیری'
                '\nایده این نظریه خیلی جالب است و به‌خوبی نشان می‌دهد که چرا هر کودک و دانش‌آموز دنیای منحصربه‌فرد خودش را دارد. این نظریه می‌گوید بنیاد یادگیری هر کودک یا دانش‌آموز، تجربیات قبلی اوست. کودکان هر چیز جدیدی که یاد می‌گیرند را به آموخته‌های قبلی‌شان اضافه می‌کنند و با آن‌ها واقعیتی را می‌سازند که منحصر به‌فرد و مختص به خودشان است.'
                'معلم‌ها چه چیزی از این نظریه یاد می‌گیرند؟ یاد می‌گیرند که کودک هر روز آموخته‌های روزهای قبلش را به محیط آموزشی می‌آورد. معلمی که به این نظریه اعتقاد دارد باید خودش را راهنما و کمک‌کننده ببیند؛ راهنمایی که کمک می‌کند کودک جهان شناختی خودش را بسازد.\n,',
            imagePath: 'assets/image/shape10.png',
          ),
          _buildTextItem(
            imageLeft: false,
            text: '۴) نظریه انسان‌گرایانه یادگیری\n '
                'این نظریه ارتباط وثیقی با نظریه برساخت‌گرایی دارد. البته روی خلاقیت کودک تاکید بیشتری دارد و ایده‌اش این است که کودکان بتواند فرایند خودشکوفایی (self-actualization) را طی کنند. خودشکوفایی چیست؟ فرایندی است که در پایان آن -یا در لحظاتی از آن- احساس می‌کنند بهترین نسخه خودشان هستند؛ بهترین موجودی هستند که می‌توانند باشند.\n'
                'این خودشکوفایی از نظر انسان‌گرایان در بالاترین نقطه از هرم نیازهای انسانی قرار دارد و بنابراین وظیفه نظام آموزشی یا معلمان این است که بتوانند نیازهای مادی و معنوی کودکان را برطرف کنند و محیطی امن برای آن‌ها فراهم آورند تا کودکان بتوانند مسیر خودشکوفایی را طی کنند.,\n',
            imagePath: 'assets/image/shape11.png',
          ),
          _buildTextItem(
            imageLeft: true,
            text: '۵) نظریه پیوندی یادگیری\n'
            '\nنظریه پیوندی یادگیری از نظریه‌های قبلی که روی خود فرد منفرد متمرکز بودند فراتر می‌رود و روی پیوندها و ارتباطات افراد متمرکز می‌شود. ایده‌اش این است که انسان‌ها وقتی با دیگری ارتباط برقرار می‌کنند یاد می‌گیرند. این دیگری هم می‌تواند افراد دیگر باشند و هم نقش‌ها و تعهدات و مسئولیت‌ها باشند.'
          '\nمعلمان با الهام از این نظریه می‌توانند، کودکان را در معرض محیط‌ها، جمع‌ها و اتفاقات هیجان‌انگیزی قرار دهند که کودک بتواند با آن‌ها ارتباط بگیرد و از آن‌ها یاد بگیرد. استفاده از رسانه‌های دیجیتال در این زمینه می‌تواند بسیار مثمرثمر باشد.'
          ,
            imagePath: 'assets/image/shape12.png',
          ),
          // _buildTextItem(
          //   imageLeft: false,
          //   text: 'sasan',
          // ),
        ],
      ),
    );
  }

  Widget _buildFirstText() {
    return SizedBox(
      width: Get.width,
      height: Get.height * .2,
      child: Stack(
        children: [
          Align(
            alignment: Alignment.topRight,
            child: Image(
              image: const AssetImage(
                'assets/image/shape7.png',
              ),
              width: Get.width * .8,
              height: Get.height * .2,
              fit: BoxFit.fill,
            ),
          ),
          Container(
            width: double.maxFinite,
            height: double.maxFinite,
            padding: EdgeInsets.symmetric(
              horizontal: Get.width * .15,
            ),
            child: const Center(
              child: Text(
                'هیچ دو کودکی شبیه هم نیستند. مغز هر کودک پدیده‌ای منحصربه‌فرد است و فرایند یادگیری آن هم همین‌طور. راه‌های یادگیری به اندازه راه‌های رسیدن به خداوند نامحدود است. روان‌شناسان ساعت‌ها زمان صرف کرده‌اند تا فهم بهتری از فرایند یادگیری کودکان و دانش‌آموزان به دست بیاورند. \n\n'
                'فرایند آموزش نمی‌تواند نسبت به این تلاش‌ها بی‌تفاوت باشد؛ به‌خصوص آن دسته از والدین و معلمانی که می‌خواهند فرایند یادگیری کودکان و شاگردان‌شان را بهبود بخشند. بنابراین شناخت مکاتب و نظریه‌های روان‌شناسی بسیار به کار والدین و معلمان می‌آید. سرجمع، پنج نظریه آموزشی-روان‌شناختی درباره فرایند یادگیری وجود دارد.',
                textAlign: TextAlign.center,
                style: TextStyle(
                  fontFamily: 'koodak',
                  fontSize: 20.0,
                ),
              ),
            ),
          )
        ],
      ),
    );
  }

  Widget _buildTextItem({
    required bool imageLeft,
    required String text,
    required String imagePath,
  }) {
    return SizedBox(
      width: Get.width,
      child: Directionality(
        textDirection: (imageLeft) ? TextDirection.rtl : TextDirection.ltr,
        child: Row(
          children: [
            Flexible(
              flex: 2,
              child: Container(
                padding: EdgeInsets.symmetric(
                  horizontal: Get.width * .1,
                ),
                width: double.maxFinite,
                child: Center(
                  child: Text(
                    text,
                    textAlign: TextAlign.center,
                    style: const TextStyle(
                      fontFamily: 'koodak',
                      fontSize: 20.0,
                    ),
                  ),
                ),
              ),
            ),
            Flexible(
              flex: 1,
              child: SizedBox(
                child: Center(
                  child: Image(
                    image: AssetImage(
                      imagePath,
                    ),
                    height: Get.width * .25,
                    width: Get.width * .25,
                  ),
                ),
              ),
            )
          ],
        ),
      ),
    );
  }
}
