import 'package:flutter/material.dart';
import 'package:get/get.dart';

class BuildLastTextThirdArtWidget extends StatelessWidget {
  const BuildLastTextThirdArtWidget({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Container(
      width: Get.width,
      height: Get.height * .5,
      padding: EdgeInsets.symmetric(
        horizontal: Get.width * .1,
      ),
      child: const Center(
        child: Text(
          '\nاصول‌بنیادین نظریه انسان‌گرایانه یادگیری'
          'آرمان و هدف این نظریه خودشکوفایی است؛ اینکه انسان‌ها به بهترین نسخه خود برسند و از خود رضایت کافی داشته‌ باشند. به نظر انسان‌گرایان، انسان‌ها این انگیزه را دارند که چنین فرایندی را طی کنند و در این راه هرچه لازم باشد یاد خواهند گرفت.\n\n'
          'انتخاب: انتخاب در این نظریه نقش مرکزی دارد. نظریه انسان‌گرایانه یک نظریه یادگیرنده-محور است. کودک به عنوان عنصر یادگیرنده در مرکز فرایند یادگیری است و باید خودش انتخاب کند. او باید بر فرایند یادگیری خودش اشراف و تسلط داشته باشد. کودکان تشویق می‌شوند که برای مدت زمان معقولی روی یک موضوع تمرکز کنند و خودشان آن را بکاوند. یادگیری زمانی به بهترین شکل اتفاق می‌افتد که کودک خود بخواهد چیزی را یاد بگیرد.\n\n'
          'تعامل و مشارکت: مشارکت کودک در فرایند آموزش مهم‌ترین انگیزه برای یادگیری است. بهترین معلمان آن‌هایی است که کودک را در فرایند یادگیری دخیل می‌کنند و آن‌ها را تشویق می‌کنند درباره چیزهایی که علاقه دارند یا برای‌شان هیجان دارند، کاوش کنند.\n\n'
          'خودارزیابی: هدف نهایی رضایت فرد از خودش است. بنابراین در فرایند آموزش هم مهم‌ترین مسئله این است که کودک بتواند خودش را ارزیابی کند؛ نه اینکه وابسته به ارزیابی دیگران باشد. بدیهی است که انسان‌گراها با سیستم نمره‌دهی کلاسیک زیاد همدل نباشند چرا که این سیستم باعث می‌شود کودکان به جای اینکه معیارهای خودشان را پیدا کنند دنبال کسب رضایت دیگران و سیستم باشند.\n\n'
          'احساس و دانش: هردوی این‌ها برای فرایند یادگیری مهم هستند و نباید از هم جدا باشند. فعالیت آموزشی باید بر کل کودک، هم بعد معرفتی و هم بعد احساسی او متمرکز باشد.\n\n'
          'محیط امن: تاکید انسان‌گرایان بر کلیت موجودیت انسانی سبب می‌شود که همه نیازهای او را در نظر بگیرد. محیط امن رمز برآوردن این نیازها است چرا که وقتی محیط به معنای واقعی امن باشد یعنی بخش عمده‌ نیازهای کودک فراهم آمده است.\n\n',
          textAlign: TextAlign.center,
          style: TextStyle(
            fontFamily: 'koodak',
            fontSize: 20.0,
          ),
        ),
      ),
    );
  }
}
